package niuke.b_字符串;

public class commonProblems {
	/**
	 * 字符串题目的特点
	 * 1. 字符串可以看做成字符类型的数组，涉及到数组的查找、排序、调整
	 * 2. 问题的广泛性：很多问题进过深度剖析以后，都可以转化为字符串类型的问题
	 * 
	 * 需要掌握的概念
	 * 1. 回文数
	 * 2. 子串
	 * 3. 子序列
	 * 4. 前缀数
	 * 5. 后缀数和后缀数组
	 * 6. 匹配
	 * 7. 字典序 
	 * 
	 * 需要掌握的操作
	 * 1. 字符的增删改查
	 * 2. 字符的替换
	 * 3. 字符串的选择操作
	 * 
	 * 
	 * 题目常见类型
	 * 1. 判断规则
	 * 		字符串是否符合证书规则
	 * 		字符串是否符合浮点数规则
	 * 		字符串是否符合浮点数规则
	 * 2. 数字运算
	 * 		大数的加减乘除运算
	 * 3. 与数组有关的操作
	 * 		数组的排序、查找
	 * 		快排的划分过程需要掌握和能够灵活调整和修改
	 *  4. 字符计数
	 *  	使用哈希表
	 *  	使用固定长度的数组[C/C++ 0-255 Java 0-65535]
	 *  	滑动窗口问题、寻找无重复字符子串问题、计算变位词问题
	 *  5. 动态规划问题
	 *  	最长公共子串、最长公共子序列
	 *  	最长回文子串、最长回文子序列问题
	 *  6. 搜索类型
	 *  	 宽度优先搜索、深度优先搜索 
	 *  7. 高级算法与数据结构解决的问题
	 *  	Mnancher 算法解决最长回文子串问题
	 *  	KMP算法字符串匹配问题
	 *  	前缀数结构、后缀数和后缀数组
	 *  	
	 */

}
